In [1]:
import numpy as np
import pandas as pd

In [2]:
np.arange(1,16)

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15])

In [4]:
np.random.randint(50,300,size=15)

array([239, 183, 101, 174, 243, 203,  99,  61, 295, 213, 181, 141,  65,
       264, 222])

In [6]:
np.random.randint(50,150,size=15)

array([124, 127,  85,  86,  82,  59, 107,  50, 103, 107, 104, 136, 102,
        64, 100])

In [8]:
x={'days':[ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15],
  'customers':[239, 183, 101, 174, 243, 203,  99,  61, 295, 213, 181, 141,  65,
       264, 222],
  'sold':[124, 127,  85,  86,  82,  59, 107,  50, 103, 107, 104, 136, 102,
        64, 100]}

In [9]:
x

{'days': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15],
 'customers': [239,
  183,
  101,
  174,
  243,
  203,
  99,
  61,
  295,
  213,
  181,
  141,
  65,
  264,
  222],
 'sold': [124, 127, 85, 86, 82, 59, 107, 50, 103, 107, 104, 136, 102, 64, 100]}

In [10]:
#dataframe

In [11]:
y=pd.DataFrame(x)

In [12]:
y

    days  customers  sold
0      1        239   124
1      2        183   127
2      3        101    85
3      4        174    86
4      5        243    82
5      6        203    59
6      7         99   107
7      8         61    50
8      9        295   103
9     10        213   107
10    11        181   104
11    12        141   136
12    13         65   102
13    14        264    64
14    15        222   100

In [13]:
y.shape

(15, 3)

In [14]:
y.columns

Index(['days', 'customers', 'sold'], dtype='object')

In [17]:
y.values

array([[  1, 239, 124],
       [  2, 183, 127],
       [  3, 101,  85],
       [  4, 174,  86],
       [  5, 243,  82],
       [  6, 203,  59],
       [  7,  99, 107],
       [  8,  61,  50],
       [  9, 295, 103],
       [ 10, 213, 107],
       [ 11, 181, 104],
       [ 12, 141, 136],
       [ 13,  65, 102],
       [ 14, 264,  64],
       [ 15, 222, 100]], dtype=int64)

In [18]:
y.size

45

In [19]:
#-- incorporated-numpy scipy matpolotlib

In [21]:
y.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15 entries, 0 to 14
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   days       15 non-null     int64
 1   customers  15 non-null     int64
 2   sold       15 non-null     int64
dtypes: int64(3)
memory usage: 488.0 bytes

In [22]:
y.head()

   days  customers  sold
0     1        239   124
1     2        183   127
2     3        101    85
3     4        174    86
4     5        243    82

In [23]:
y.head(5)

   days  customers  sold
0     1        239   124
1     2        183   127
2     3        101    85
3     4        174    86
4     5        243    82

In [28]:
y.head(7) #counts

   days  customers  sold
0     1        239   124
1     2        183   127
2     3        101    85
3     4        174    86
4     5        243    82
5     6        203    59
6     7         99   107

In [29]:
y.tail()

    days  customers  sold
10    11        181   104
11    12        141   136
12    13         65   102
13    14        264    64
14    15        222   100

In [31]:
y.tail(2)

    days  customers  sold
13    14        264    64
14    15        222   100

In [36]:
y.tail(15)

    days  customers  sold
0      1        239   124
1      2        183   127
2      3        101    85
3      4        174    86
4      5        243    82
5      6        203    59
6      7         99   107
7      8         61    50
8      9        295   103
9     10        213   107
10    11        181   104
11    12        141   136
12    13         65   102
13    14        264    64
14    15        222   100

In [37]:
y

    days  customers  sold
0      1        239   124
1      2        183   127
2      3        101    85
3      4        174    86
4      5        243    82
5      6        203    59
6      7         99   107
7      8         61    50
8      9        295   103
9     10        213   107
10    11        181   104
11    12        141   136
12    13         65   102
13    14        264    64
14    15        222   100

In [38]:
y.iloc[3]

days           4
customers    174
sold          86
Name: 3, dtype: int64

In [39]:
y.loc[3]

days           4
customers    174
sold          86
Name: 3, dtype: int64

In [45]:
y.iloc[3:5]

   days  customers  sold
3     4        174    86
4     5        243    82

In [46]:
y['sold']

0     124
1     127
2      85
3      86
4      82
5      59
6     107
7      50
8     103
9     107
10    104
11    136
12    102
13     64
14    100
Name: sold, dtype: int64

In [47]:
max(y['sold'])

136

In [48]:
y[y['sold']==max(y['sold'])]

    days  customers  sold
11    12        141   136